INSERT INTO department (number) VALUES (16), (20), (36), (40), (41), (47);

INSERT INTO area (name, department_id)
VALUES
    ('Участок комплектации и ЗИП', 1),
    ('Участок изготовления и монтажа труб', 2),
    ('Сварочный участок', 2),
    ('Участок изоляции и гидравлических испытаний', 2),
    ('Участок сборочно-сварочный №11', 3),
    ('Участок монтажа судовой вентиляции №5', 4),
    ('Участок заготовки изоляции', 5),
    ('Участок деревообработки', 5),
    ('Участок изготовления узлов, фундаментов и деталей машиностроительной части', 1);

INSERT INTO criterion (name) VALUES ('Общая оценка'), ('ОТ/ПБ'), ('5С'), ('ТРМ'), ('КПСЦ'), ('СВМ');

INSERT INTO area_criterion (area_id, criterion_id) VALUES (1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (1, 6),
                                                          (2, 1), (2, 2), (2, 3), (2, 4), (2, 5), (2, 6),
                                                          (3, 1), (3, 2), (3, 3), (3, 4), (3, 5), (3, 6),
                                                          (4, 1), (4, 2), (4, 3), (4, 4), (4, 5), (4, 6),
                                                          (5, 1), (5, 2), (5, 3), (5, 4), (5, 5), (5, 6),
                                                          (6, 1), (6, 2), (6, 3), (6, 4), (6, 5), (6, 6),
                                                          (7, 1), (7, 2), (7, 3), (7, 4), (7, 5), (7, 6),
                                                          (8, 1), (8, 2), (8, 3), (8, 4), (8, 5), (8, 6),
                                                          (9, 1), (9, 2), (9, 3), (9, 4), (9, 5), (9, 6);

INSERT INTO result (area_criterion_id, week, value) VALUES (1, 31), (1, 32), (1, 33), (1, 34),
                                                           (2, 31), (2, 32), (2, 33), (2, 34),
                                                           (3, 31), (3, 32), (3, 33), (3, 34),
                                                           (4, 31), (4, 32), (4, 33), (4, 34),
                                                           (5, 31), (5, 32), (5, 33), (5, 34),
                                                           (6, 31), (6, 32), (6, 33), (6, 34),
                                                           (7, 31), (7, 32), (7, 33), (7, 34),
                                                           (8, 31), (8, 32), (8, 33), (8, 34),
                                                           (9, 31), (9, 32), (9, 33), (9, 34),
                                                           (10, 31), (10, 32), (10, 33), (10, 34),



select ca.id, d.number, a.name, criterion.name from criterion
                                                 join area_criterion ca on criterion.id = ca.criterion_id
                                                 join public.area a on a.id = ca.area_id
                                                 join public.department d on a.department_id = d.id;