INSERT INTO category (name) VALUES ('One more category'), ('Another categ'),
                                   ('Else category'), ('Second categ'),
                                  ('First categ'), ('Final category');

INSERT INTO post (title, description, chapter_id)
VALUES
    ('АО "Объединённая судостроительная корпорация" (ОСК)', 'Российский государственный судостроительный холдинг.', 1),
    ('ПАО Судостроительный завод "Северная верфь"', 'Судостроительное предприятие, расположенное в городе Санкт-Петербург.', 1),
    ('Бережливое производство', 'Концепция организации бизнеса, ориентированная на создание привлекательной ценности для потребителя путем формирования непрерывного потока создания ценности с охватом всех процессов организации и их постоянного совершенствования через вовлечение персонала и устранение всех видов потерь.', 1),
    ('Бизнес-процесс', 'Последовательность действий, преобразующих ресурсы в продукт или услугу, полезные потребителю.', 1),
    ('Владелец процесса', 'Должностное лицо организации, наделенное правами и полномочиями, имеющий в своем распоряжении персонал, инфраструктуру, программное и аппаратное обеспечение, информацию о бизнес процессе, который несёт ответственность за бизнес процесс во всех его аспектах - планирование, обеспечение, управление и улучшение процесса.', 1),
    ('Заказчик', 'Тот, кто использует результат вашей работы (может быть внешний и внутренний).', 1),
    ('Предложение по улучшению (ППУ)', 'Предложение работника, направленное на улучшение его деятельности посредством организационных методов (улучшение состояния рабочих мест, повышение эффективности использования ресурсов и т.д.), методов организации и управления хозяйством.', 1),
    ('Производственная система', 'Cистема управления эффективностью предприятия, ориентированная на максимизацию ценности путем непрерывного совершенствования бизнес-процессов и устранения потерь на всех этапах жизненного цикла продукции.', 1),
    ('ПС-проект', 'Проект, нацеленный на оптимизацию повторяющегося процесса или решение конкретной проблемы в процессе с применением инструментов Производственной Системы АО «ОСК».', 1),
    ('Стенд визуального менеджмента (СВМ)', 'Инструмент визуализации, предназначенный для отображения оперативной информации о производственных процессах, протекающих в подразделении, о состоянии производственной среды, соответствии подразделения требованиям системы 5С, позволяющий системно подходить к решению проблем подразделения.', 1),
    ('5С', 'Система организации рабочего пространства, обеспечивающая безопасное и эффективное выполнение работ.', 2),
    ('1С - Сортировка', 'Это шаг, в котором все материалы, оборудование и инструмент сортируют на нужные всегда, нужные иногда и ненужные.', 2),
    ('Потери (muda)', 'Любая работа (деятельность), которая потребляет ресурсы, но не создает ценности для заказчика.', 3),
    ('Брак и переделка', 'Это изготовление продуктов, предоставление услуг, не соответствующих требованиям заказчика, а также мероприятия по устранению этих дефектов.', 3),
    ('Время такта', 'Расчетный интервал времени, с которым следует производить единицу продукции, чтобы соответствовать требованиям заказчика.', 4),
    ('Время цикла', 'Фактический интервал времени периодически повторяющейся технологической операции.', 4),
    ('Автономное обслуживание оборудования', 'Самостоятельное обслуживание производственным персоналом (работниками) производственного оборудования путем ежедневного контроля, очистки, смазки для устранения и предотвращения возникновения дефектов и поддержания оборудования в базовом состоянии.', 5),
    ('Быстрая переналадка', 'Процесс переналадки производственного оборудования для перехода от производства одного вида детали к другому за минимальное время.', 5),
    ('Дефект', 'Каждое отдельное несоответствие продукции установленным требованиям.', 6),
    ('Диаграмма Ишикавы', 'Графический способ исследования и определения наиболее существенных причинно-следственных взаимосвязей между факторами и последствиями в исследуемой ситуации или проблеме.', 6);


